# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

def new_list(lst):
    new_lst = []
    if len(lst) % 2 == 0:
        l = len(lst) // 2
    else:
        l = len(lst) // 2 + 1
    for i in range(l):
        new_lst.append(lst[i] * lst[len(lst) - i - 1])
    return new_lst


lst = [2, 3, 4, 5, 6, 7, 8, 9, 10, 5, 1]  # нечетное количество
# lst = [2, 3, 4, 5, 6, 7, 8, 9, 10, 5]  четное количество

print(f' Список чисел {lst}\n')
print(f'Произведение пар чисел: {new_list(lst)}')
